pulseaudio_dlna/plugins/dlna/upnp/xml/register.xml

<?xml version='1.0' encoding='{encoding}'?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <u:SetAVTransportURI xmlns:u="{service_type}">
      <InstanceID>0</InstanceID>
      <CurrentURIMetaData>{current_url_metadata}</CurrentURIMetaData>
      <CurrentURI>{stream_url}</CurrentURI>
    </u:SetAVTransportURI>
  </s:Body>
</s:Envelope>
